/*Написать программу, которая из имеющегося массива 
сток формирует массив из строк, длина которых меньше, 
либо равна 3 символа.*/

Console.WriteLine("Введите текст: ");
string text = Console.ReadLine()!;
Console.WriteLine(text);



